jameslee-hahaha/insem_nordic/NCS200_SLM_RTC_nrf9160dk/src/slm_at_host.c
	return 0;
}

bool in_datamode(void)
{
	return (slm_operation_mode == SLM_DATA_MODE);
}

bool exit_datamode(int exit_mode)
{
	if (slm_operation_mode == SLM_DATA_MODE) {
		ring_buf_reset(&data_rb);
		/* reset UART to restore command mode */
		uart_rx_disable(uart_dev);
		k_sleep(K_MSEC(10));
		(void)uart_receive();

		if (exit_mode == DATAMODE_EXIT_OK) {
			strcpy(rsp_buf, OK_STR);
		} else if (exit_mode == DATAMODE_EXIT_ERROR) {
			strcpy(rsp_buf, ERROR_STR);
		} else {
			sprintf(rsp_buf, "\r\n#XDATAMODE: 0\r\n");
		}
		rsp_send(rsp_buf, strlen(rsp_buf));

		slm_operation_mode = SLM_AT_COMMAND_MODE;
		datamode_handler = NULL;
		LOG_INF("Exit datamode");
		return true;
	}

	return false;
}

int poweroff_uart(void)
{
	int err;

	uart_rx_disable(uart_dev);
	k_sleep(K_MSEC(100));
	err = pm_device_action_run(uart_dev, PM_DEVICE_ACTION_SUSPEND);
	if (err && err != -EALREADY) {
		LOG_ERR("Can't suspend uart: %d", err);
	}

	return err;
}

static void delayed_send(struct k_work *work)
{
	uint8_t *data = NULL;
	int size_send;

	/* NOTE ring_buf_get_claim() might not return full size */
	do {
		size_send = ring_buf_get_claim(&delayed_rb, &data, UART_TX_DATA_SIZE);
		if (data != NULL && size_send > 0) {
			(void)uart_send(data, size_send);
			(void)ring_buf_get_finish(&delayed_rb, size_send);
		} else {
			break;
		}
	} while (true);
}

int poweron_uart(void)
{
	int err;

	err = pm_device_action_run(uart_dev, PM_DEVICE_ACTION_RESUME);
	if (err && err != -EALREADY) {
		LOG_ERR("Can't resume uart: %d", err);
		return err;
	}

	k_sleep(K_MSEC(100));

	err = uart_receive();
	if (err) {
		return err;
	}

	k_sem_give(&tx_done);
	uart_send(SLM_SYNC_STR, sizeof(SLM_SYNC_STR)-1);
	k_work_submit(&delayed_send_work);

	return 0;
}

int slm_uart_configure(void)
{
	int err;

	LOG_DBG("Set uart baudrate to: %d, hw flow control %d", slm_uart.baudrate,
		slm_uart.flow_ctrl);

	err = uart_configure(uart_dev, &slm_uart);
	if (err != 0) {
		LOG_ERR("uart_configure: %d", err);
		return err;
	}
#if defined(CONFIG_SLM_UART_HWFC_RUNTIME)
/* Set HWFC dynamically */
	#if defined(CONFIG_SLM_CONNECT_UART_0)
		#define RTS_PIN DT_PROP(DT_NODELABEL(uart0), rts_pin)
		#define CTS_PIN DT_PROP(DT_NODELABEL(uart0), cts_pin)
		if (slm_uart.flow_ctrl == UART_CFG_FLOW_CTRL_RTS_CTS) {
			nrf_uarte_hwfc_pins_set(NRF_UARTE0,
						RTS_PIN,
						CTS_PIN);
		} else {
			nrf_gpio_pin_clear(RTS_PIN);
			nrf_gpio_cfg_output(RTS_PIN);
		}
	#endif
	#if defined(CONFIG_SLM_CONNECT_UART_2)
		#define RTS_PIN DT_PROP(DT_NODELABEL(uart2), rts_pin)
		#define CTS_PIN DT_PROP(DT_NODELABEL(uart2), cts_pin)
		if (slm_uart.flow_ctrl == UART_CFG_FLOW_CTRL_RTS_CTS) {
			nrf_uarte_hwfc_pins_set(NRF_UARTE2,
						RTS_PIN,
						CTS_PIN);
		} else {
			nrf_gpio_pin_clear(RTS_PIN);
			nrf_gpio_cfg_output(RTS_PIN);
		}
	#endif
#endif
	return err;
}

bool verify_datamode_control(uint16_t time_limit, uint16_t *min_time_limit)
{
	int min_time;

	if (slm_uart.baudrate == 0) {
		LOG_ERR("Baudrate not set");
		return false;
	}

	min_time = UART_RX_LEN * (8 + 1 + 1) * 1000 / slm_uart.baudrate;
	min_time += UART_RX_MARGIN_MS;

	if (time_limit > 0 && min_time > time_limit) {
		LOG_ERR("Invalid time_limit: %d, min: %d", time_limit, min_time);
		return false;
	}

	if (min_time_limit) {
		*min_time_limit = min_time;
	}

	return true;
}

AT_MONITOR(at_notify, ANY, notification_handler);

static void notification_handler(const char *response)
{
	if (slm_operation_mode == SLM_AT_COMMAND_MODE) {
		/* Forward the data over UART */
		rsp_send("\r\n", 2);
		rsp_send(response, strlen(response));
	}
}

#if defined(CONFIG_SLM_NRF52_DFU)
/* Overall, nRF52 DFU is supported or not */
#if defined(CONFIG_SLM_NRF52_DFU_LEGACY)
/* Functions for legacy Serial DFU Protocol, UART is in TX and RX */
#define DFU_RX_MAX_DELAY 1000 /* in milliseconds */
static K_SEM_DEFINE(dfu_response, 0, 1);

void enter_dfumode(void)
{
	if (slm_operation_mode != SLM_DFU_MODE) {
		slm_operation_mode = SLM_DFU_MODE;
		LOG_INF("Enter dfumode");
	}
}

void exit_dfumode(void)
{
	if (slm_operation_mode == SLM_DFU_MODE) {
		/* reset UART to restore command mode */
		uart_rx_disable(uart_dev);
		k_sleep(K_MSEC(10));
		slm_operation_mode = SLM_AT_COMMAND_MODE;
		(void) uart_receive();
		LOG_INF("Exit dfumode");
	}
}

int dfu_drv_tx(const uint8_t *data, uint16_t length)
{
	int ret = 0;

	if (length == 0 || slm_operation_mode != SLM_DFU_MODE) {
		return -EINVAL;
	}

	if (length > SLIP_SIZE_MAX) {
		ret = -ENOMEM;
	} else {
		uint32_t slip_pkt_len;

		encode_slip(rsp_buf, &slip_pkt_len, data, length);
		LOG_HEXDUMP_DBG(rsp_buf, slip_pkt_len, "DFU-TX");
		ret = uart_send(rsp_buf, slip_pkt_len);
	}

	return ret;
}

int dfu_drv_rx(uint8_t *data, uint32_t max_len, uint32_t *real_len)
{
	int ret;

	if (data == NULL) {
		return -EINVAL;
	}

	at_buf_len = 0;
	ret = k_sem_take(&dfu_response, K_MSEC(DFU_RX_MAX_DELAY));
	if (ret) {
		LOG_ERR("DFU response error: %d", ret);
		return -EAGAIN;
	}

	ret = decode_slip(data, real_len, at_buf, at_buf_len);
	if (ret) {
		return ret;
	}
	if (*real_len > max_len) {
		return -ENOMEM;
	}

	LOG_HEXDUMP_DBG(data, *real_len, "DFU-RX");

	return 0;
}

static int dfu_rx_handler(const uint8_t *data, int datalen)
{
	memcpy(at_buf + at_buf_len, data, datalen);
	at_buf_len += datalen;

	if (at_buf[at_buf_len - 1] == SLIP_END) {
		k_sem_give(&dfu_response);
	}

	return 0;
}
#else
/* Functions for MCUBOOT-based DFU protocol, UART is in TX only */
void enter_dfumode(void)
{
	if (slm_operation_mode != SLM_DFU_MODE) {
		slm_operation_mode = SLM_DFU_MODE;
		/* only UART Send */
		uart_rx_disable(uart_dev);
		k_sleep(K_MSEC(10));
		LOG_INF("Enter dfumode");
	}
}

void exit_dfumode(void)
{
	if (slm_operation_mode == SLM_DFU_MODE) {
		slm_operation_mode = SLM_AT_COMMAND_MODE;
		(void) uart_receive();
		LOG_INF("Exit dfumode");
	}
}

int dfu_drv_tx(const uint8_t *data, uint16_t length)
{
	if (length == 0 || slm_operation_mode != SLM_DFU_MODE) {
		return -EINVAL;
	}

	return uart_send(data, length);
}
#endif /* CONFIG_SLM_NRF52_DFU_LEGACY */
#endif /* CONFIG_SLM_NRF52_DFU */

static void raw_send(struct k_work *work)
{
	uint8_t *data = NULL;
	int size_send, size_sent;
	const char *quit_str = CONFIG_SLM_DATAMODE_TERMINATOR;
	int quit_str_len = strlen(quit_str);
	bool datamode_off_pending = false;

