jameslee-hahaha/insem_nordic/NCS200_SLM_RTC_nrf9160dk/src/slm_at_host.c
	ARG_UNUSED(work);

	/* NOTE ring_buf_get_claim() might not return full size */
	do {
		size_send = ring_buf_get_claim(&data_rb, &data, sizeof(at_buf));
		if (data != NULL && size_send > 0) {
			/* Exit datamode if apply */
			if (size_send >= quit_str_len) {
				char *quit = data + (size_send - quit_str_len);

				if (strncmp(quit, quit_str, quit_str_len) == 0) {
					memset(quit, 0x00, quit_str_len);
					size_send -= quit_str_len;
					datamode_off_pending = true;
				}
				if (size_send == 0) {
					k_work_submit(&datamode_quit_work);
					LOG_INF("datamode off pending");
					return;
				}
			}
			/* Raw data sending */
			int size_finish = datamode_off_pending ? quit_str_len : 0;

			LOG_INF("Raw send %d", size_send);
			LOG_HEXDUMP_DBG(data, MIN(size_send, HEXDUMP_DATAMODE_MAX), "RX-DATAMODE");
			if (datamode_handler && size_send > 0) {
				size_sent = datamode_handler(DATAMODE_SEND, data, size_send);
				if (size_sent > 0) {
					size_finish += size_sent;
				} else if (size_sent == 0) {
					size_finish += size_send;
				} else {
					LOG_WRN("Raw send failed, %d dropped", size_send);
					size_finish += size_send;
					datamode_off_pending = true;
				}
				(void)ring_buf_get_finish(&data_rb, size_finish);
			} else {
				LOG_WRN("no handler, %d dropped", size_send);
				(void)ring_buf_get_finish(&data_rb, size_send + size_finish);
			}

			if (datamode_off_pending) {
				k_work_submit(&datamode_quit_work);
				LOG_INF("datamode off pending");
				return;
			}
		} else {
			break;
		}
	} while (true);

	/* resume UART RX in case of stopped by buffer full */
	if (datamode_rx_disabled) {
		(void)uart_receive();
		datamode_rx_disabled = false;
	}
}

static void inactivity_timer_handler(struct k_timer *timer)
{
	ARG_UNUSED(timer);

	LOG_INF("time limit reached");
	if (!ring_buf_is_empty(&data_rb)) {
		k_work_submit(&raw_send_work);
	} else {
		LOG_WRN("data buffer empty");
	}
}

K_TIMER_DEFINE(inactivity_timer, inactivity_timer_handler, NULL);

static void datamode_quit(struct k_work *work)
{
	ARG_UNUSED(work);

	/* quit datamode */
	if (datamode_handler) {
		(void)datamode_handler(DATAMODE_EXIT, NULL, 0);
	} else {
		LOG_WRN("missing datamode handler");
	}
	(void)exit_datamode(DATAMODE_EXIT_OK);
}

static int raw_rx_handler(const uint8_t *data, int datalen)
{
	int ret;

	k_timer_stop(&inactivity_timer);

	/* save data to buffer */
	ret = ring_buf_put(&data_rb, data, datalen);
	if (ret != datalen) {
		LOG_ERR("enqueue data error (%d, %d)", datalen, ret);
		uart_rx_disable(uart_dev);
		return -1;
	}
	ret = ring_buf_space_get(&data_rb);
	if (ret < UART_RX_LEN) {
		LOG_WRN("data buffer full (%d)", ret);
		uart_rx_disable(uart_dev);
		return -1;
	}

	/* start/restart inactivity timer */
	k_timer_start(&inactivity_timer, K_MSEC(datamode_time_limit), K_NO_WAIT);

	return 0;
}

/*
 * Check AT command grammar based on below.
 *  AT<NULL>
 *  AT<separator><body><NULL>
 *  AT<separator><body>=<NULL>
 *  AT<separator><body>?<NULL>
 *  AT<separator><body>=?<NULL>
 *  AT<separator><body>=<parameters><NULL>
 * In which
 * <separator>: +, %, #
 * <body>: alphanumeric char only, size > 0
 * <parameters>: arbitrary, size > 0
 */
static int cmd_grammar_check(const uint8_t *cmd, uint16_t length)
{
	const uint8_t *body;

	/* check AT (if not, no check) */
	if (length < 2 || toupper((int)cmd[0]) != 'A' || toupper((int)cmd[1]) != 'T') {
		return -EINVAL;
	}

	/* check AT<NULL> */
	cmd += 2;
	if (*cmd == '\0') {
		return 0;
	}

	/* check AT<separator> */
	if ((*cmd != '+') && (*cmd != '%') && (*cmd != '#')) {
		return -EINVAL;
	}

	/* check AT<separator><body> */
	cmd += 1;
	body = cmd;
	while (true) {
		/* check body is alphanumeric */
		if (!isalpha((int)*cmd) && !isdigit((int)*cmd)) {
			break;
		}
		cmd++;
	}

	/* check body size > 0 */
	if (cmd == body) {
		return -EINVAL;
	}

	/* check AT<separator><body><NULL> */
	if (*cmd == '\0') {
		return 0;
	}

	/* check AT<separator><body>= or check AT<separator><body>? */
	if (*cmd != '=' && *cmd != '?') {
		return -EINVAL;
	}

	/* check AT<separator><body>?<NULL> */
	if (*cmd == '?') {
		cmd += 1;
		if (*cmd == '\0') {
			return 0;
		} else {
			return -EINVAL;
		}
	}

	/* check AT<separator><body>=<NULL> */
	cmd += 1;
	if (*cmd == '\0') {
		return 0;
	}

	/* check AT<separator><body>=?<NULL> */
	if (*cmd == '?') {
		cmd += 1;
		if (*cmd == '\0') {
			return 0;
		} else {
			return -EINVAL;
		}
	}

	/* no need to check AT<separator><body>=<parameters><NULL> */
	return 0;
}

static void format_final_result(char *buf)
{
	static const char ok_str[] = "OK\r\n";
	static const char error_str[] = "ERROR\r\n";
	static const char cme_error_str[] = "+CME ERROR:";
	static const char cms_error_str[] = "+CMS ERROR:";
	static const char crlf_str[] = "\r\n";
	char *result = NULL, *temp;

	/* find the last occurrence of final result string */
	result = strstr(buf, ok_str);
	if (result) {
		temp = result;
		while (temp != NULL) {
			temp = strstr(result + strlen(ok_str), ok_str);
			if (temp) {
				result = temp;
			}
		}
		goto final_result;
	}
	result = strstr(buf, error_str);
	if (result) {
		temp = result;
		while (temp != NULL) {
			temp = strstr(result + strlen(error_str), error_str);
			if (temp) {
				result = temp;
			}
		}
		goto final_result;
	}
	result = strstr(buf, cme_error_str);
	if (result) {
		temp = result;
		while (temp != NULL) {
			temp = strstr(result + strlen(cme_error_str), cme_error_str);
			if (temp) {
				result = temp;
			}
		}
		goto final_result;
	}
	result = strstr(buf, cms_error_str);
	if (result) {
		temp = result;
		while (temp != NULL) {
			temp = strstr(result + strlen(cms_error_str), cms_error_str);
			if (temp) {
				result = temp;
			}
		}
	}
	if (result == NULL) {
		LOG_WRN("Final result not found");
		return;
	}

final_result:
	/* insert CRLF before final result if there is information response before it */
	if (result != buf) {
		memmove((void *)(result + strlen(crlf_str)), (void *)result, strlen(result) + 1);
		memcpy((void *)result, (void *)crlf_str, strlen(crlf_str));
	}
}

